## Testando SQL + Python no Jupyter :)

By: Ariane Hayana

In [14]:
import pandas as pd
import sqlite3

In [ ]:
# Instalando python-sql
!pip install ipython-sql

In [16]:
# Conectando sql+py
conect = sqlite3.connect('jupy.db')

In [27]:
# Criando um dataframe para importar os dados
df = pd.DataFrame({'nome': ['Ariane','Hayana','Farias'],
                   'id': ['id0001','id0002','id0003'],
                   'num': [10,20,30]})
df

     nome      id  num
0  Ariane  id0001   10
1  Hayana  id0002   20
2  Farias  id0003   30

In [35]:
df.to_sql('tabela', conect)

3

In [36]:
# Carregando modulo sql para py
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
%sql sqlite:///jupy.db

In [38]:
%%sql

SELECT * FROM tabela

 * sqlite:///jupy.db
Done.

[(0, 'Ariane', 'id0001', 10),
 (1, 'Hayana', 'id0002', 20),
 (2, 'Farias', 'id0003', 30)]

In [39]:
%%sql

SELECT count(*) FROM tabela

 * sqlite:///jupy.db
Done.

[(3,)]

In [41]:
%%sql

SELECT sum(num) as 'num' FROM tabela

 * sqlite:///jupy.db
Done.

[(60,)]